<table style="background-color:#F5F5F5;" width="100%">
<tr><td style="background-color:#F5F5F5;"><img src="../images/logo.png" width="100" align='right'/></td></tr>     <tr><td>
            <h1><center>Aprendizagem Automática em Engenharia Biomédica</center></h1>
            <h3><center>1st Semester - 2021/2022</center></h3>
            <h4><center>Universidade Nova de Lisboa - Faculdade de Ciências e Tecnologia</center></h4>
</td></tr>
    <tr><td><h1><center>Lab 1 - Python language </center></h1></td></tr>
</table>

# 1. `print()` function

__Step 1__: print Hello, World!

In [1]:
print('Hello, World!')

Hello, World!

__Step 2__: print the result of a mathematical operation

__Step 3__: print multiple argumments inside the `print()` function using strings and numerical values

`print(x1,x2,x3)` multiple arguments separated by a comma are concatenated after being convert to a string

Escape characters such as "\n", which represents a change of line in the string, can be used within the `print()` function

# 2. Python Operators

### 2.1. Arithmetic Operators

1. Addition `+` adds two values on either side of the operator;
2. Subtraction `-` subtracts the righ hand operand from the left hand operand;
3. Multiplication `*` multiplies values on either side of the operator;
4. Division `/` divides left hand operand by right hand operand;
5. Modulus `%` divides left hand operand by right hand operand and returns remainder;
6. Floor division `//` division of operands where the result is the quotient in which the digits after the decimal point are removed.
7. Exponent `**` performs the exponential (power) calculation on operators.

In [2]:
print(3+5)    # plus operator 
print(3-5)    # minus operator
print(3*5)    # multiplication operator
print(3/5)    # division operator
print(3%5)    # modulus operator
print(3//5)   # floor operator
print(3**5)   # the exponent operator

8
-2
15
0.6
3
0
243

### 2.2. Comparison Operators


1. `==` returns true if the values of two operands are equal;	
2. `!=` returns true if the values of two operands are not equal;
3. `<` returns true if the value of left operand is less than the value of right operand;
4. '`>` returns true if the value of left operand is greater than the value of right operand;
5. `<=` returns true if the value of left operand is less or equal than the value of right operand;
6. `>=` returns true if the value of left operand is greater or equal than the value of right operand;

In [3]:
print(3==5)
print(3!=5)
print(3>5)
print(3<5)
print(3<=5)
print(3>=5)

False
True
False
True
True
False

### 2.3. Assignment Operators

1. `=` assigns values from right side operands to left side operand;
2. `+=` adds right operand to the left operand and assign the result to left operand;
3. `-=` subtracts right operand to the left operand and assign the result to left operand;
4. `*=` multiplies the right operand with the left operand and assign the result to left operand;	
5. `/=` divides the left operand with the right operand and assign the result to left operand;	
6. '`%=` takes modulus using two operands and assign the result to left operand;	
7. `**=` performs exponential (power) calculation on operators and assign value to the left operand;	
8. `//=` performs floor division on operators and assign value to the left operand;

In [4]:
a = 3
print(a)

a += 3
print(a)

a -= 3
print(a)

a *= 3
print(a)

a /= 3
print(a)

a **= 3
print(a)

a //= 3
print(a)

a %= 3
print(a)

3
6
3
9
3.0
27.0
9.0
0.0

# 3. Variables

Variables are reserved memory locations that store values. This means that when you create a variable you reserve some space in memory. Python has no command for declaring a variable, instead a variable is created the moment you first assign a value to it.

There are three __numeric types__ in Python:

1. int
2. float
3. complex

In [5]:
x = 3    # int
y = 3.5  # float
z = 3j   # complex
print(type(x))
print(type(y))
print(type(z))

<class 'int'>
<class 'float'>
<class 'complex'>

Conversion between different types.

In [6]:
x = "3.55"
y = 3.55
print(float(x))
print(str(y))

3.55
3.55

A __String__ is a variable that conists in an array of characters.

In [7]:
s = " Hello, World! ";

print(s)
print(s[1])               # prints the second character
print(s[2:5])             # slice characters 3 to 5 from string s
print(s[2:10:2])          # slice characters 3 to 10 from string s in steps of 2
print(s.lower())          # lower cases the entire string
print(s.upper())          # upper cases the entire string
print(len(s))             # prints the number of characters (the length) in the string
print(s.strip())          # removes white spaces at begining and end of string
print(s.replace('H','J')) # replace all 'H' characters by "J"
print(s.split(','))       # splits all strings using "," as a separator into a list

 Hello, World!
H
ell
el,W
 hello, world!
 HELLO, WORLD!
15
Hello, World!
 Jello, World!
[' Hello', ' World! ']

# 4. Collection data types

1. <b>List</b> is a collection which is ordered and changeable. Allows duplicate members.
2. <b>Tuple</b> is a collection which is ordered and unchangeable. Allows duplicate members.
3. <b>Set</b> is a collection which is unordered and unchangeable. No duplicate members.
4. <b>Dictionary</b> is a collection which is unordered, changeable and indexed. No duplicate members.

__Lists__

In [8]:
thislist = ["apple", "banana", "cherry"]
print(thislist)

# change the value of the second element of thislist
thislist[1] = "blackcurrant" 
print(thislist)

# add element
thislist.append("damson")
print(thislist)

# remove element
thislist.remove("apple")
print(thislist)

['apple', 'banana', 'cherry']
['apple', 'blackcurrant', 'cherry']
['apple', 'blackcurrant', 'cherry', 'damson']
['blackcurrant', 'cherry', 'damson']

__Tuples__

In [9]:
thistuple = ("apple", "banana", "cherry")
print(thistuple)

# get element
print(thistuple[1])

# not possible to change or add new elements ()
# thistuple[1] = "blackcurrant"

('apple', 'banana', 'cherry')
banana

__Sets__

In [10]:
thisset = {"apple", "banana", "cherry"}
print(thisset)

# add element
thisset.add("passionfruit")
print(thisset)

# remove element
thisset.remove("banana")
print(thisset)

{'banana', 'cherry', 'apple'}
{'banana', 'cherry', 'passionfruit', 'apple'}
{'cherry', 'passionfruit', 'apple'}

__Dictionaries__

In [11]:
thisdict = {
  "apple": "green",
  "banana": "yellow",
  "cherry": "red"
}
print(thisdict)

# get element
print(thisdict["apple"])

# add element
thisdict["damson"] = "purple"
print(thisdict)

# remove element
del(thisdict["banana"])
print(thisdict)

{'apple': 'green', 'banana': 'yellow', 'cherry': 'red'}
green
{'apple': 'green', 'banana': 'yellow', 'cherry': 'red', 'damson': 'purple'}
{'apple': 'green', 'cherry': 'red', 'damson': 'purple'}

Extract all keys and values from a dictionary using `.keys()` and `.values()`, respectivetly.

In [12]:
thisdict = dict(apple="green", banana="yellow", cherry="red")
print(thisdict.keys())
print(thisdict.values())

dict_keys(['apple', 'banana', 'cherry'])
dict_values(['green', 'yellow', 'red'])

# 5. Flow Control with Loops and If Statements

A __for__ loop is used for iterating over a sequence (that is either a list, a tuple or a string).

In [13]:
elements = ['bread','butter','cheese']
for el in elements:
    print(el)

bread
butter
cheese

In [14]:
for el in range(5):
    print(el)

0
1
2
3
4

With the __while__ loop we can execute a sequence of statements as long as a condition is true.

In [15]:
i = 1
while i < 5:
    print(i)
    i += 1

1
2
3
4

the __if__ statement allow us to to make a comparison between variables and return a desired output.

In [16]:
a = 3
b = 5
if b > a: 
    print("b is greater than a")
elif b < a:
    print("a is greater than b")
else:
    print("b is equal to a")

b is greater than a

# 6. Functions

The function bellow finds the position of a target value in a list, if target value is not find it returns -1

In [17]:
def find_position(to_search, target):
    for i, value in enumerate(to_search):
        if value == target:
            return i
    return -1

In [18]:
a = ['a','b','c']
print(find_position(a, 'b'))
print(find_position(a, 'd'))

1
-1

# 7. Ipython

Ipython  <b>?</b> Introduction and overview of IPython’s features

In [19]:
?

`object?` returns details about ‘object’ including docstrings, function definition lines (for call arguments) and constructor details for classes. `object??` returns extra details.

In [20]:
print?

In [21]:
print??

<b>!command</b> runs a System shell Command.

In [22]:
# list all files in current directory
!ls

'Lab 1 - Python language.ipynb'
'Lab 2 - Python for scientific computation.ipynb'
'Lab 3 - Data preparation.ipynb'
'Lab 4 - Statistical Machine Learning.ipynb'
'Lab 5 - Feature extraction and Decision Trees.ipynb'
'Lab 6 - Feature Selection.ipynb'
'Lab 7 - Supervised Learning Classifiers, Evaluation and Optimization.ipynb'
'Lab 8 - Unsupervised Learning Classifiers.ipynb'
'Lab 9 - Deep Learning.ipynb'
 __MACOSX
'UCI HAR Dataset'
'UCI HAR Dataset.zip'

In [23]:
!pwd

/home/marilia/Documents/Projects/PhD/nova-aaeb-docentes/Labs

In [24]:
!mkdir "teste"

In [25]:
!ls

'Lab 1 - Python language.ipynb'
'Lab 2 - Python for scientific computation.ipynb'
'Lab 3 - Data preparation.ipynb'
'Lab 4 - Statistical Machine Learning.ipynb'
'Lab 5 - Feature extraction and Decision Trees.ipynb'
'Lab 6 - Feature Selection.ipynb'
'Lab 7 - Supervised Learning Classifiers, Evaluation and Optimization.ipynb'
'Lab 8 - Unsupervised Learning Classifiers.ipynb'
'Lab 9 - Deep Learning.ipynb'
 __MACOSX
 teste
'UCI HAR Dataset'
'UCI HAR Dataset.zip'

In [26]:
!rm -r teste

# 8. Exercises

## Exercises using ipython

__Exercise 1__: Hello world in the console.
>print(“Hello World”)

__Exercise 2__: ipython as my calculator
> 4 + 5 * 5 + 2 ** 4

> sqrt(3 ** 2+ 4 ** 2)

__Exercise 3__: Set a bookmark for your testing code directory
> bookmark mydir

Measure the time (timeit) of sorting 1000 random integers or
random floats. (`random.randint` and `random.uniform`)

## Exercises using the notebook

In [27]:
import numpy as np

__Exercise 4__: Print the times tables

__Exercise 5__: Create a list with first 10 powers of 2.

__Exercise 6__: Test if a string is a palindrome: radar, civic

__Exercise 7__: Use a list comprehension to create a list of uniform distribution
(use `import random`, and `random.uniform(0,10)` )

## Exercises using spyder

__Exercise 8__: Implement the factorial function

__Exercise 9__: Finding the maximum value in a list.
Show an example on the operating in the following list `[1,5,4,3,-1]`.

Hint use a memory initialized with the first element of the list.

__Exercise 10__: Count numbers in the [EMG file](https://github.com/hgamboa/novainstrumentation/blob/master/novainstrumentation/data/emg.txt)

__Exercise 11__: Find the most used word in Lusiadas [pg3333.txt](https://github.com/hgamboa/novainstrumentation/blob/master/novainstrumentation/sandbox/pg3333.txt).

# 9. Pandas

Pandas is an open-source, BSD-licensed Python library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. 

#### Key Features of Pandas
- Fast and efficient DataFrame object with default and customized indexing.
- Tools for loading data into in-memory data objects from different file formats.
- Data alignment and integrated handling of missing data.
- Reshaping and pivoting of date sets.
- Label-based slicing, indexing and subsetting of large data sets.
- Columns from a data structure can be deleted or inserted.
- Group by data for aggregation and transformations.
- High performance merging and joining of data.
- Time Series functionality.

In [28]:
import pandas as pd

## 9.1 Series

Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is to call:

`pd.Series(data, index=index)`

In [29]:
# Series from a dictonary
x = {'b' : 1, 'a' : 0, 'c' : 2}
pd.Series(x)

b    1
a    0
c    2
dtype: int64

In [30]:
# Series from a ndarray
x = np.random.randn(5)
foo = pd.Series(x, index=['a', 'b', 'c', 'd', 'e'], name='series_name')
foo

a    1.411515
b    2.406725
c   -0.919476
d   -0.646054
e    0.930807
Name: series_name, dtype: float64

In [31]:
foo.values # returns values in a series

array([ 1.41151482,  2.40672483, -0.91947555, -0.64605429,  0.93080689])

In [32]:
foo.index # returns the index values of the series

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [33]:
# get value
foo['a']

1.4115148219205287

In [34]:
# set value 
foo['a'] = 0.0

foo

a    0.000000
b    2.406725
c   -0.919476
d   -0.646054
e    0.930807
Name: series_name, dtype: float64

## 9.2 DataFrame

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. Like Series, DataFrame accepts many different kinds of input:
- Dict of 1D ndarrays, lists, dicts, or Series
- 2-D numpy.ndarray
- Structured or record ndarray
- A Series
- Another DataFrame

In [35]:
# from Series
x = {'Name' : pd.Series(['Ana', 'Maria', 'Ricardo', 'Pedro']), 
     'Number' : pd.Series([2111, 2112, 2113]),
     'Test': np.array([15, 16, 16, 15]),
     'Project': [13, 18, 18, 15]}
students_list = pd.DataFrame(x)
students_list

      Name  Number  Test  Project
0      Ana  2111.0    15       13
1    Maria  2112.0    16       18
2  Ricardo  2113.0    16       18
3    Pedro     NaN    15       15

In [36]:
students_list.index

RangeIndex(start=0, stop=4, step=1)

In [37]:
students_list.columns

Index(['Name', 'Number', 'Test', 'Project'], dtype='object')

In [38]:
students_list['Final Grade'] = students_list['Test'] * 0.6 + students_list['Project'] * 0.4
students_list['course'] = 'Eng. Biomédica'
students_list

      Name  Number  Test  Project  Final Grade          course
0      Ana  2111.0    15       13         14.2  Eng. Biomédica
1    Maria  2112.0    16       18         16.8  Eng. Biomédica
2  Ricardo  2113.0    16       18         16.8  Eng. Biomédica
3    Pedro     NaN    15       15         15.0  Eng. Biomédica

## 9.3 Exercises

Exercises based on https://github.com/justmarkham

__Step 1__: Import the necessary libraries

In [39]:
import pandas as pd

__Step 2__: Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

__Step 3__: Assign it to a variable called users and use the `user_id` as index

In [40]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')

__Step 4__: See the first 25 entries

In [41]:
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

__Step 5__: See the last 10 entries

In [42]:
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

__Step 6__: What is the number of observations in the dataset?

In [43]:
users.shape[0]

943

__Step 7__: What is the number of columns in the dataset?

In [44]:
users.shape[1]

4

__Step 8__: Print the name of all the columns.

In [45]:
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

__Step 9__: How is the dataset indexed?

In [46]:
# "the index" (aka "the labels")
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

__Step 10__: What is the data type of each column?

In [47]:
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

__Step 11__: Print only the occupation column

In [48]:
users.occupation

#or

users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

__Step 12__: How many different occupations are in this dataset?

In [49]:
users.occupation.nunique()

# or

users.occupation.value_counts().count()

21

__Step 13__: What is the most frequent occupation?

In [50]:
users.occupation.value_counts().head(1).index[0]

# users.occupation.value_counts().head()

'student'

__Step 14__: Summarize the DataFrame.

In [51]:
users.describe() # Notice: by default, only the numeric columns are returned.

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

__Step 15__: Summarize all the columns

In [52]:
users.describe(include = "all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

__Step 16__: Summarize only the occupation column

In [53]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

__Step 17__: What is the mean age of users?

In [54]:
round(users.age.mean())

34

__Step 18__: What is the age with least occurrence?

In [55]:
users.age.value_counts().tail()

11    1
10    1
73    1
66    1
7     1
Name: age, dtype: int64

__Step 19__: Select the rows 3 to 7 and the columns 3 to 6

In [56]:
users.iloc[2:7, 2:6]

            occupation zip_code
user_id
3               writer    32067
4           technician    43537
5                other    15213
6            executive    98101
7        administrator    91344

__Step 20__: Select every row up to the 4th row and all columns

In [57]:
users.iloc[:4, :]

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537

__Step 21__: Select users 4, 5, 6 and all columns

In [58]:
users.loc[[4, 5, 6]]

         age gender  occupation zip_code
user_id
4         24      M  technician    43537
5         33      F       other    15213
6         42      M   executive    98101